In [1]:
# Upgrade NumPy to the latest version
# !pip install --upgrade numpy

# # Upgrade Pandera to ensure compatibility
# !pip install --upgrade pandera

In [2]:
# Check for outdated packages and update them
!pip list --outdated

In [3]:
# !pip install --upgrade pybind11

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('ships.csv')
df

              name        lat        lng
0      Black Pearl  20.664865 -80.709747
1            Cobra  20.664868 -80.709740
2  Flying Dutchman  20.664878 -80.709941
3          Empress        NaN        NaN
4                   20.664875 -80.709777

In [3]:
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

In [4]:
df.iloc[-1]['name']

' '

In [5]:
df['name'] = df['name'].str.strip()
df.iloc[-1]['name']

''

In [6]:
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

In [7]:
import numpy as np
mask = df['name'].str.strip() == ''
df.loc[mask, 'name'] = np.nan

In [8]:
df[df.isnull().any(axis=1)]

      name        lat        lng
3  Empress        NaN        NaN
4      NaN  20.664875 -80.709777